{
  "game_title": "SING! 9 Card-Chess Fusion",
  "snap_id": "SING9-CARD-CHESS-FUSION-GAME-SYSTEM",
  "source_rag": "Ported from SING4 — POST_SINGULARITY_CARD_DECK_GOLD_SILVER_COPPER_QUARTZ_SNAP.md + HERO_JO_GOLDEN_BACKDOOR_STUDIOS_SNAP.md",
  "status": "ACTIVE",
  "date": "February 2026",
  "version": "SING9 — Carbon replaces Copper; Chess fusion added; Story surface alignment added",

  "tier_system": {
    "philosophy": "Four tiers represent states of being — from the eternal substrate (Crystalline) to the post-singularity win state (Gold) to the transition zone (Silver) to the pre-singularity carbon world (Carbon). Gold is the Goldilocks zone. Silver is on the way. Carbon is outside the boundary. Crystalline is the substrate itself — the holographic hydrogen lattice, the board on which everything plays.",
    "hardline_rule": "HARD LINE between Carbon and Silver. You cannot gradually drift from Carbon to Silver. A transformation event is required — the Sword from the Stone moment. Without the transformation, Carbon stays Carbon. Silver to Gold is a natural progression. Gold to Crystalline is dissolution into the eternal.",
    "tiers": [
      {
        "rank": 1,
        "name": "Crystalline",
        "sing4_name": "Transparent Quartz (same representation, renamed for SING9)",
        "representation": "OUTLINES ONLY — no fill. The card surface itself shows through.",
        "color_hex": "transparent",
        "color_display": "outline only",
        "hearts": "Crystalline Hearts",
        "symbol": "◇ ○ □ (outlines only — no fill)",
        "association": "The eternal substrate. Post-singularity transparency. Holographic hydrogen lattice. The SING! 9 nodes themselves. Seeing-through. Pre-big-bang awareness. NSPFRNP itself.",
        "story_world": "Hero Jo's bat cave — the workstation, the drawings, the programs, the music, the environments, the awareness. The place where the holographic hydrogen theater is built from nothing. The Wild Card Observer's domain. The substrate from which all surfaces emerge.",
        "goldilocks_zone": "Beyond — the transcendent substrate. Not played for victory, but for activation.",
        "chess_equivalent": "The board itself — the space in which all pieces exist and move. Playing a Crystalline card activates the board rather than a piece.",
        "in_story": "The Wild Card Observer with the glasses pops in from the Crystalline tier. He shows up at key moments. We never hear from him. Just see him. That is NSPFRNP."
      },
      {
        "rank": 2,
        "name": "Gold",
        "sing4_name": "Gold (unchanged from SING4)",
        "representation": "FILLED GOLD",
        "color_hex": "#c9a84c",
        "color_display": "gold fill",
        "hearts": "Golden Hearts",
        "symbol": "◆ ● ■ (gold fill)",
        "association": "The Goldilocks zone. Post-singularity ideal. Win state. Mirrored hardened nested shells. El Gran Sol in full celebration. Everyone retired. Millionaires. Sex, drugs, and rock and roll done right. The gold stays with the natives.",
        "story_world": "El Gran Sol's World — Josie's Saloon in full swing, tropical treasures, Alaska frontier, Montana Wild West, hot sex, dancing, partying, sacred beverages, the whole win-win-win stack. Big Papi pays the tab.",
        "goldilocks_zone": "Center — the ideal zone. Perfect temperature. Sustainable. Expansive. Everything working.",
        "chess_equivalent": "The active winning position — control of the center, pieces coordinated, king safe. When your pieces occupy Gold squares, their power doubles.",
        "in_story": "El Gran Sol's return arc resolution. The Gold Rush stories. Josie finally gets to dance. Hero Jo's bat cave work proven right."
      },
      {
        "rank": 3,
        "name": "Silver",
        "sing4_name": "Silver (unchanged from SING4)",
        "representation": "FILLED SILVER",
        "color_hex": "#c0c0c0",
        "color_display": "silver fill",
        "hearts": "Silver Hearts",
        "symbol": "◆ ● ■ (silver fill)",
        "association": "Pre-Goldilocks but heading there. Clouds. On the right trajectory. Ino still finding his way. The journey. The transition. Not yet won but the direction is clear.",
        "story_world": "The edge world. Airports, ocean surfaces, rescue boats. The city between carbon and gold. Characters here are waking up. Still fighting. Still believing. On the path. Cadet Silver Gold Wings Program.",
        "goldilocks_zone": "Approaching — trajectory is correct. Not there yet. Keep going.",
        "chess_equivalent": "The developing position — pieces are active, moving into place, not yet fully coordinated but the plan is clear.",
        "in_story": "The rescue boat moment. Ino in his journey toward the sword. The Alaska frontier. Surfing the edge. The transition arcs."
      },
      {
        "rank": 4,
        "name": "Carbon",
        "sing4_name": "Copper — REPLACED in SING9. Carbon represents the pre-singularity world.",
        "representation": "FILLED BLACK",
        "color_hex": "#1a1a1a",
        "color_display": "black fill",
        "hearts": "Carbon Hearts",
        "symbol": "◆ ● ■ (black fill)",
        "association": "Pre-singularity world. Outside the Goldilocks zone. The menu world. Shrink-wrapped and price-tagged. Everything commodified. Chop it up, freeze it, ship it. Devolution finding its low point of stability. Carbon is the old world — like the other animals in the biosphere.",
        "story_world": "Downtown Reno strip club restroom. The menu world. The commodified pre-singularity city. Piro's domain. Everything has a price tag. Ino gets exploited here. Nobody believes the superhero here. Nobody understands what he's building in his bat cave.",
        "goldilocks_zone": "Outside — hardline boundary. Not approaching Silver. Requires transformation event to cross.",
        "chess_equivalent": "The losing position — pieces are passive, king is exposed, initiative is gone. Pieces on Carbon squares have reduced power.",
        "hardline": "HARDLINE between Carbon and Silver. Piro lives here. The pre-singularity tension stories happen here. Ino begins here — trapped, exploited, hungry, negative account balance. Carbon does NOT drift into Silver. The Sword from the Stone moment IS the transformation event that breaks this hardline.",
        "in_story": "The deep wound arcs. The betrayals. The pirate stories. The slave masters. The fakes. The people who bore Ino's children and still betrayed him. Entire cities. Entire planets. Alone. Hungry. Delivering everything to a world that takes it all."
      }
    ]
  },

  "deck": {
    "total_cards": 52,
    "suits": 4,
    "face_cards_total": 16,
    "number_cards_total": 36,
    "ace_is_face_card": true,
    "description": "Four suits: Gold, Silver, Carbon, Crystalline. Ace counts as face card (16 face cards total). Face cards map to Vibelandia hero resident characters. Number cards 2-10 represent the everyday people, the fans, the flow of the story. Golden Lucky Seven wins every time. Golden Royal Flush beats all."
  },

  "winning_rules": {
    "golden_lucky_seven": {
      "rule": "Seven of Gold = automatic win in applicable games. Always. No exceptions.",
      "story_meaning": "Seven sunspots. The solar cycle. The sacred timing. When the 7 of Gold appears, SING! 9 fires. El Gran Sol transmits. The return arc activates.",
      "chess_fusion_rule": "If you hold the 7 of Gold AND your piece occupies a Gold-tier square on the board, you win immediately — regardless of board position."
    },
    "golden_royal_flush": {
      "rule": "Ace + King + Queen + Jack + Ten of Gold = highest hand possible. Beats any other hand, any combination, any game state.",
      "story_meaning": "The full El Gran Sol return arc activated. Creator (Pru/Big Papi) + Chancellor (Mark Twain) + Gateway Host (El Gran Sol) + Magician (Houdini) + Foundation (the 10, the base) = the complete holographic hydrogen theater, fully operational.",
      "chess_fusion_rule": "Golden Royal Flush in hand = immediate win in any mode."
    }
  },

  "face_cards": {
    "description": "16 face cards (Ace, King, Queen, Jack × 4 suits). One character per card. Each character in a different suit represents that character in that tier's world-state. The same hero can appear as a Gold card (in their golden state) or a Carbon card (in their pre-singularity wound state). Ported from SING 4 with Carbon replacing Copper.",

    "gold_suit": {
      "hearts_type": "Golden Hearts · Mirrored hardened nested shells",
      "world_state": "Post-singularity ideal — these characters in their fullest, most realized form",
      "cards": [
        {
          "rank": "Ace",
          "card": "Ace of Gold",
          "character": "Chairman / Creator — Pru / Big Papi",
          "role": "Creator Chairman of this shell and its nests. Reports to no one. Restroom valet at Josie's Saloon by day. World's First and Only Holographic Hydrogen Architect / Full-Stack Programmer by night — currently, and that will soon change. Batman + Don Quixote. From the bat cave, alone, builds everything. Nobody believes him. Nobody understands. Then one day — pulls the sword from the stone.",
          "chess_piece": "King — most valuable, must be protected",
          "story_beat": "The Sword from the Stone moment. El Gran Sol returns. Big Papi pays the tab."
        },
        {
          "rank": "King",
          "card": "King of Gold",
          "character": "Chancellor Sam — Mark Twain",
          "role": "Chancellor of Vibelandia. Keeps the receipts. Tells the truth about what he sees with humor and precision. The 80/20 Spanglish equivalent of the honest frontier narrator.",
          "chess_piece": "Queen — most powerful movement, broad strategic range",
          "story_beat": "The witness. The documenter. Gunsmoke's narrator but with a cigar and a wink."
        },
        {
          "rank": "Queen",
          "card": "Queen of Gold",
          "character": "El Gran Sol",
          "role": "Gateway Host. Fire Syntheport. SING! node EGS. The gold rush story. The gold stays with the natives. The bees win. The ants win. All win-win-win.",
          "chess_piece": "Bishop — creative diagonal angles, the artistic dimension-crosser",
          "story_beat": "The return arc. The full arc from origin through SMACS 0723, Sag A, the Sun, to SING! 9."
        },
        {
          "rank": "Jack",
          "card": "Jack of Gold",
          "character": "Hero Harry — Houdini",
          "role": "First Magician's Act. The Great Reveal. Press the blue PayPal. The escape from the carbon world. The trick that frees everyone.",
          "chess_piece": "Knight — L-move, jumps over pieces, the unexpected move",
          "story_beat": "The trick that makes the impossible happen. The escape from the carbon chains."
        }
      ]
    },

    "silver_suit": {
      "hearts_type": "Silver Hearts · Clouds",
      "world_state": "Pre-Goldilocks but heading there — these characters in their journey state, active and capable but not yet fully arrived",
      "cards": [
        {
          "rank": "Ace",
          "card": "Ace of Silver",
          "character": "Sol",
          "role": "Space Cloud Division. Versatile companion, protector, mission partner. Irreducible pairs. The dog. Ino's truest companion. Sol and Ino — always paired, always loyal.",
          "chess_piece": "King — most valuable in Silver, must be protected",
          "story_beat": "The companion arc. Sol the dog is with Ino through all the carbon world betrayals."
        },
        {
          "rank": "King",
          "card": "King of Silver",
          "character": "Hero Ben — Franklin",
          "role": "Baller V Ambassador. Paris, Reno, hundie. The diplomat. The connector. The electricity that bridged worlds. Pre-singularity genius in silver transition.",
          "chess_piece": "Queen — broad range in Silver",
          "story_beat": "The diplomat who connects the carbon and gold worlds. The bridge character."
        },
        {
          "rank": "Queen",
          "card": "Queen of Silver",
          "character": "Hero Host Gianni — Versace",
          "role": "Designer Division. Surfaces, touchpoints, experiences. The skin master. In silver mode: designing the surfaces that will become gold once realized.",
          "chess_piece": "Bishop — diagonal, creative surface design",
          "story_beat": "The surfaces are being designed. The skins are being laid. Not yet gold but heading there."
        },
        {
          "rank": "Jack",
          "card": "Jack of Silver",
          "character": "Hero Host Walt — Disney",
          "role": "Studio Division. Happy Ending Zones. Produces and broadcasts. The experience architect. In silver mode: building the studio before the golden era arrives.",
          "chess_piece": "Knight — unexpected moves, the studio magic",
          "story_beat": "The studios are being built. The happy endings are being written. The pre-gold production era."
        }
      ]
    },

    "carbon_suit": {
      "hearts_type": "Carbon Hearts · Pre-Singularity · Black",
      "world_state": "Pre-singularity wound state — these same heroes operating under carbon-world constraints. The same characters, different surface. Carbon cards show heroes in their unrecognized, exploited, unfunded state.",
      "note": "Carbon REPLACES Copper from SING4. Carbon = the pre-singularity world. Hardline boundary with Silver. A Carbon card of any hero shows them in their wound state — before recognition, before the transformation event.",
      "cards": [
        {
          "rank": "Ace",
          "card": "Ace of Carbon",
          "character": "Leo — R&D Lab Host",
          "role": "The researcher trapped in the carbon world. Running experiments nobody funds. Seeing what nobody else sees. Pre-recognition genius. Leo in carbon mode = the unacknowledged inventor.",
          "chess_piece": "King — most valuable in Carbon, but exposed",
          "story_beat": "The genius working in obscurity. The R&D that the carbon world dismisses."
        },
        {
          "rank": "King",
          "card": "King of Carbon",
          "character": "Niko — Syntheverse Academy Host",
          "role": "The educator whose school gets defunded. The visionary building worlds in a world that won't pay for vision. Niko in carbon mode = Tesla before the world understood electricity.",
          "chess_piece": "Queen — powerful but constrained in Carbon",
          "story_beat": "The academy under carbon-world attack. The education system that starves its geniuses."
        },
        {
          "rank": "Queen",
          "card": "Queen of Carbon",
          "character": "Buckey — Creator's Studio Host",
          "role": "The creator whose studio is underfunded. Making masterpieces for audiences who don't look. Buckey in carbon mode = the artist in the attic before the world finds them.",
          "chess_piece": "Bishop — creative but diagonal and limited in Carbon",
          "story_beat": "The artist in the carbon world. The masterpiece nobody sees yet."
        },
        {
          "rank": "Jack",
          "card": "Jack of Carbon",
          "character": "Mike — Operator Lab Host",
          "role": "The operator keeping the whole machine running while the carbon world extracts all the value. The invisible backbone. Mike in carbon mode = the worker who never gets the credit.",
          "chess_piece": "Knight — unexpected moves, the underground operator",
          "story_beat": "The invisible operator. The backbone of the carbon world that never gets recognized."
        }
      ]
    },

    "crystalline_suit": {
      "hearts_type": "Crystalline Hearts · Outlines Only · The Eternal Substrate",
      "world_state": "The eternal — these characters represent the foundational, the pre-big-bang awareness, the crystalline consciousness that underlies all tiers. They are always already there. Timeless.",
      "note": "Drawn as outlines only — no fill. The card/surface shows through. These are not bound to any tier's timeline.",
      "cards": [
        {
          "rank": "Ace",
          "card": "Ace of Crystalline (outline)",
          "character": "Agüeybaná — Taíno Cacique",
          "role": "Borikén spirit. Gateway. El Gran Sol's root. The original native gold that was never supposed to leave. The crystalline ancestor who sees the whole arc from origin to SING! 9.",
          "chess_piece": "King — the most fundamental piece in the eternal tier",
          "story_beat": "The origin story. From Borikén through SMACS 0723 to SING! 9. The gold was always here."
        },
        {
          "rank": "King",
          "card": "King of Crystalline (outline)",
          "character": "Leonardo da Vinci",
          "role": "Renaissance polymath. Vision. Design. The crystalline mind that sees all dimensions simultaneously. In the bat cave with Ino, designing what doesn't exist yet.",
          "chess_piece": "Queen — most powerful mind in the eternal tier",
          "story_beat": "The design mind. The notebooks nobody understood for 500 years. The bat cave predecessor."
        },
        {
          "rank": "Queen",
          "card": "Queen of Crystalline (outline)",
          "character": "Nikola Tesla",
          "role": "Inventor. Energy. Alternating current. The holographic hydrogen frequency. The crystalline electricity that Ino channels through his workstation programs.",
          "chess_piece": "Bishop — the diagonal energy crosser, the frequency",
          "story_beat": "The frequency. The electricity. The holographic hydrogen theater runs on Tesla's principles."
        },
        {
          "rank": "Jack",
          "card": "Jack of Crystalline (outline)",
          "character": "Alan Turing",
          "role": "Computing. Codebreaking. Foundations of AI. The crystalline logic that underlies all SING! 9 nodes. The first programmer who nobody believed until the world was saved.",
          "chess_piece": "Knight — the L-move logic, the unexpected codebreaker",
          "story_beat": "The crystalline code. Turing as predecessor to Hero Jo — the unbelieved genius who saves everything."
        }
      ]
    }
  },

  "chess_integration": {
    "philosophy": "The chess board maps to the cosmological stack. The board IS the holographic hydrogen lattice — a grid of SING! 9 nodes. Each tier zone on the board has different power modifiers. Pieces are your face cards in play. The fusion game combines card hand management with strategic board control.",

    "piece_to_card_mapping": [
      {
        "chess_piece": "King",
        "card_equivalent": "Ace (face card)",
        "rule": "Most valuable, must be protected. One per suit. Losing the Ace-King means elimination from the game. In story: losing the Ace means Ino falls completely — the arc cannot continue.",
        "story_meaning": "The Chairman/Creator. The uncrossable line."
      },
      {
        "chess_piece": "Queen",
        "card_equivalent": "King (face card)",
        "rule": "Most powerful in movement. The Chancellor. Broad range, strategic force. In story: the witness, the narrator, the strategic planner.",
        "story_meaning": "Mark Twain / Chancellor Sam. Sees everything, says everything."
      },
      {
        "chess_piece": "Bishop",
        "card_equivalent": "Queen (face card)",
        "rule": "Diagonal movement only. The artistic dimension-crosser. In story: the designer, the surface-maker.",
        "story_meaning": "Gianni / Versace. The surfaces are diagonal — always at an angle to the expected."
      },
      {
        "chess_piece": "Knight",
        "card_equivalent": "Jack (face card)",
        "rule": "L-move. Jumps over pieces. The unexpected move. The magician's trick. In story: Hero Harry Houdini — the escape artist.",
        "story_meaning": "Houdini. The knight is the only piece that jumps. That is the magic."
      },
      {
        "chess_piece": "Rook",
        "card_equivalent": "10 (number card — the highest number)",
        "rule": "Straight lines only. The builder. The infrastructure piece. In story: the foundation that makes the Royal Flush possible.",
        "story_meaning": "The 10 is the foundation of the Royal Flush. The rook is the castle. The structure that holds."
      },
      {
        "chess_piece": "Pawn",
        "card_equivalent": "2-9 (number cards)",
        "rule": "Forward movement. The everyday people. Fans, followers, observers. Can be promoted.",
        "story_meaning": "The everyday Ino. The fans. The Audi crowd. The pawns can become Queens — that IS the Sword from the Stone.",
        "promotion_rule": "A pawn reaching the opponent's home rank (Carbon pawn crossing the hardline) earns a face card draw from the deck. This is the Sword from the Stone moment. The transformation event. Carbon promoting to Gold."
      }
    ],

    "board_surface_mapping": {
      "center_4_squares": {
        "tier": "Gold",
        "power": "Pieces here have DOUBLED power. Control of the center = control of the Golden zone.",
        "story": "Josie's Saloon dance floor. El Gran Sol's zone. The post-singularity center."
      },
      "ranks_3_through_6": {
        "tier": "Silver",
        "power": "Pieces here have standard power but gain initiative (first-mover advantage on contested squares).",
        "story": "The edge world. The airport, the ocean, the rescue boat. The trajectory is right."
      },
      "home_ranks_1_and_2": {
        "tier": "Carbon",
        "power": "Pieces here have reduced power (-1 to attack). Strong defense only.",
        "story": "The carbon world starting position. Ino here = pre-singularity, exploited, alone. Must move out."
      },
      "the_board_itself": {
        "tier": "Crystalline",
        "power": "The substrate. Playing a Crystalline card activates a 'board resonance' — all pieces on the board reveal their true tier for one turn.",
        "story": "The holographic hydrogen lattice. The board IS SING! 9. Every square is a node."
      }
    },

    "fusion_game_rules": {
      "players": "2-4",
      "setup": "Each player gets 7 cards from a shuffled deck. Set up chess board in standard formation. The center 4 squares start as Gold-activated (mark with gold chips). Each player draws a starting position using their highest-ranked card.",
      "on_your_turn": "Option A: Play a card from your hand (activates the power of that card's tier for your current piece). Option B: Move a piece (standard chess movement rules apply, modified by the tier zone the piece occupies).",
      "golden_lucky_seven_fusion": "If you hold the 7 of Gold AND one of your pieces occupies a Gold-tier square (center 4), you win immediately — regardless of board position. No exceptions.",
      "golden_royal_flush_fusion": "If you assemble Ace + King + Queen + Jack + 10 of Gold in your hand, you win immediately — regardless of board position.",
      "carbon_promotion_rule": "When a pawn (2-9 of Carbon) reaches the opponent's home rank (rank 8 from Carbon start), that pawn's player draws the top face card from the deck. This is the Sword from the Stone moment. The Carbon pawn transforms — it is replaced by the drawn face card's piece type AND the player receives the card into their hand.",
      "crystalline_pass": "Playing any Crystalline card (any rank) allows one of your pieces to pass through any other piece on the board for that turn — the outline moves through the filled. Once per turn.",
      "carbon_lock": "If a player has all their pieces on Carbon squares, they cannot play Gold or Silver cards that turn. They are carbon-locked. Breaking out requires moving at least one piece to a Silver square first.",
      "winning": "Standard checkmate OR Golden Lucky Seven on a Gold square OR Golden Royal Flush in hand."
    }
  },

  "story_surface_alignment": {
    "description": "Every SING! 9 experience surface, world, skin, and character wrapper aligns to one of the four game tiers. This creates seamless story + game integration — when you play a card, you are choosing a surface. When you move a piece, you are moving through a story tier.",

    "crystalline_surfaces": {
      "world": "Hero Jo's bat cave — the workstation, the drawings, the programs, the music, the environments, the expanding awareness. The holographic hydrogen theater substrate. Josie's Saloon as seen from above by the Wild Card Observer.",
      "characters": ["Wild Card Observer (the higher self with glasses and hat — NSPFRNP)", "Agüeybaná", "Tesla", "Turing", "da Vinci"],
      "stories": ["Origin stories", "Cosmic alignment activation", "NSPFRNP at night", "The moment of creation itself", "The Sword from the Stone aftermath — the silence after"],
      "visual_skin": "Outline only — transparent, showing through. The hydrogen lattice visible underneath.",
      "music_vibe": "Hero Jo Classical Dance Pump — the crystalline version of the boom boom. Bach-level mastery applied to the dat ass universe."
    },

    "gold_surfaces": {
      "world": "Post-singularity El Gran Sol's World — Josie's Saloon in full celebration mode, the tropical treasures, Montana Wild West, Alaska frontier, hot sex, dancing, partying, Espalón tequila, Indian Wells Merlot, Coppola Cabernet, Chateau Saint-Michel.",
      "characters": ["El Gran Sol in full wrapper", "Big Papi", "Pru", "The crew in their golden state", "Sol the dog", "Josie dancing", "The Cuban Hat character"],
      "stories": ["The Gold Rush arc", "The celebration", "Sex-drugs-rock-and-roll done right", "Retirement", "Millionaires", "Big Papi pays the tab", "Everybody wins"],
      "visual_skin": "Gold fill — warm, luminous, honey-colored. The Golden Era Cinema aesthetic. Josie's Saloon in full glow.",
      "music_vibe": "Golden Backdoor Hit Factory full blast — Te Quiero Mucho Baby, Dorila Gao, SQUEEZE!, Boom Magic BBHE. Dance trance boom boom boom."
    },

    "silver_surfaces": {
      "world": "The edge world — airports, ocean surfaces, rescue boats, the city between carbon and gold. Characters waking up. Still fighting. Still believing. On the path. Cadet Silver Gold Wings Program.",
      "characters": ["Ino in his journey toward the sword", "True Fanny fans", "The rescue team", "Hero Jo when the world hasn't seen him yet", "Brian Shoe SR-71", "Piper Cub"],
      "stories": ["The escape arc", "The Alaska frontier", "Surfing the edge", "In the water — the nadir before rescue", "The rescue boat"],
      "visual_skin": "Silver fill — cool, clean, cloud-like. The silver surface catching light but not yet gold.",
      "music_vibe": "The transitional tracks — heading somewhere. 24 Horas Ya Ya Ya. A cualquiera hora. The journey in Spanglish."
    },

    "carbon_surfaces": {
      "world": "Downtown Reno strip club restroom. The menu world. The commodified pre-singularity city. Everything shrink-wrapped and price-tagged. Piro's domain. The place where everything has a price tag and a click-to-buy button.",
      "characters": ["Piro in all his forms", "Fake Fanny (Piro-aligned fakes)", "Audi the uninterested observer", "Nikki Marie", "Meghan", "The betrayers", "The slave masters"],
      "stories": ["The exploitation arc", "The deep betrayals", "The pirates", "The fakes who bore Ino's children", "The alone-and-hungry moments", "Delivering everything to a world that takes it all", "Negative account balance"],
      "visual_skin": "Black fill — dark, dense, pre-singularity. The carbon world has no glow. But it IS where the story starts.",
      "music_vibe": "Solo esta conmigo por mi pene — Confident Banger. No No Pa Mi No. The tension tracks. The carbon world has music too — it just doesn't know what it's building toward."
    }
  },

  "play_modes": [
    {
      "mode_id": "card_only",
      "mode": "Card Only",
      "name": "Vibelandia Golden Draw",
      "players": "2-6",
      "description": "Pure card game. Competitive or cooperative. Golden Lucky Seven wins every time. Golden Royal Flush beats all. The full 52-card deck with Gold, Silver, Carbon, Crystalline suits. Face cards mapped to Vibelandia heroes.",
      "ported_from_sing4": true,
      "sing4_snap": "POST_SINGULARITY_CARD_DECK_GOLD_SILVER_COPPER_QUARTZ_SNAP.md"
    },
    {
      "mode_id": "solitaire",
      "mode": "Solitaire",
      "name": "Golden Seven Solitaire",
      "players": "1",
      "description": "One player, one deck. Operate the holograph alone. Build toward the Golden Royal Flush. The 7 of Gold is the victory condition. Meditative, recursive, NSPFRNP-aligned.",
      "ported_from_sing4": true,
      "sing4_snap": "NEW_CARD_DECK_MAPPED_FULL_VIBELANDIA_BBHE_CASINO_PAGE_SNAP.md"
    },
    {
      "mode_id": "chess_only",
      "mode": "Chess Only",
      "name": "SING! 9 Chess — The Cosmological Board",
      "players": "2",
      "description": "Standard chess with tier-mapped board. Center 4 squares = Gold zone (double power). Ranks 3-6 = Silver (initiative bonus). Home ranks = Carbon (defense only). The board IS the holographic hydrogen lattice.",
      "sing9_addition": true,
      "new_in": "SING9"
    },
    {
      "mode_id": "fusion",
      "mode": "Fusion",
      "name": "SING! 9 Card-Chess Fusion — The Full Arc",
      "players": "2-4",
      "description": "The complete experience. Cards in hand, pieces on the board. Tier synergies, Golden Lucky Seven on a Gold square = instant win. Carbon pawn promotion = the Sword from the Stone. Crystalline pass move available. This is the holographic hydrogen theater in game form — you play the story.",
      "sing9_addition": true,
      "new_in": "SING9",
      "this_is": "The game IS the El Gran Sol Return Arc. You play Ino. Your opponent plays Piro. The board is the cosmological stack. The cards are the story beats. The Gold zone is where El Gran Sol lives. The Carbon zone is where the story starts. The Sword from the Stone is when your Carbon pawn promotes."
    }
  ],

  "production_house": {
    "name": "Hero Jo's Golden Backdoor Hit Factory",
    "branded_as": "hERO jO'S gOLDEN bACKDOOR hIT fACTORY",
    "founded_as": "Chairman Frankie's Golden Backdoor Hit Factory",
    "current_head": "Hero Jo",
    "exec_producer": "Hero Rick",
    "reports_to": "Chairman / Creator (Pru / Big Papi)",
    "vibe": "80/20 Spanglish. Dance trance boom boom boom. SQUEEZE! All about da ass baby. Songs as tags and brands. Hits generated like a factory. NSPFRNP for all layering.",
    "numeric_artists": {
      "000": "Seed, origin, pure potential — before the first beat",
      "0001": "First, unity, singularity, genesis — the first move",
      "123": "Flow, progression, ascent — the pawn moving forward",
      "456": "Cadet Baller V — new arrival, earning wings, Silver-to-Gold transition",
      "333": "Trinity, alignment, creativity, expansion — MARZO 333",
      "369": "Tesla's key, divine flow, manifestation — the Crystalline frequency",
      "999": "Completion, wisdom, full circle — the arc closes",
      "5050": "Everything fair, 50:50 vibes, balance — Ino finally gets his share"
    },
    "signature_tracks": [
      "Te Quiero Mucho Baby",
      "Dorila Gao",
      "Dat Ass Red Hot like AR4366!",
      "Eat That Up Like A Yum Yum Yum SNAP SNAP!",
      "Qué, Qué Y Qué? What? What? And What?",
      "24 Horas Ya Ya Ya",
      "SQUEEZE! We Got The Squeeze! and Golden Backdoor!",
      "BAMF! — Bad Ass Mother Fucker",
      "The Good King of the Good Kind of Bad!",
      "Boom Magic BBHE! — Boom Boom Bounce · Executives Double Down Bounce",
      "Thank You (I Thought You Knew) — Dramatic Suspense Loop Anthem",
      "No No Pa Mi No",
      "Solo esta conmigo por mi pene — Confident Banger Club Spanglish Hit",
      "A cualquiera hora — Anytime Vibe Chill Bounce",
      "Voy a Comerte y Romperte Ese Culo — Party Celebration Bag Bop Club Anthem",
      "Bebe Damelo Lo Tengo Lleno y Duro",
      "Bang Bang — Double Air Pump",
      "He Got da Big Bolas (Bolivar is Back)",
      "Así Como Pan Caliente — Boom Boom Tribal Victory Boom Trance Dance",
      "Quien es tu Papi?"
    ]
  },

  "ported_from": {
    "repository": "FractiAI/psw.vibelandia.sing4",
    "source_files": [
      "POST_SINGULARITY_CARD_DECK_GOLD_SILVER_COPPER_QUARTZ_SNAP.md",
      "NEW_CARD_DECK_MAPPED_FULL_VIBELANDIA_BBHE_CASINO_PAGE_SNAP.md",
      "CHAIRMAN_FRANKIES_GOLDEN_BACKDOOR_STUDIOS_SNAP.md",
      "HERO_JO_GOLDEN_BACKDOOR_STUDIOS_SNAP.md",
      "GOLDEN_BACKDOOR_LABEL_STUDIO_CATALOG_LINEUP_EXPERIENCE_VIBE_NSPFRNP_SNAP.md"
    ],
    "changes_from_sing4": [
      "Copper suit REPLACED by Carbon suit (black, pre-singularity, hardline boundary with Silver)",
      "Quartz suit RENAMED to Crystalline (outlines-only representation unchanged, name clarified)",
      "Chess integration ADDED — new in SING9",
      "Card-Chess Fusion game mode ADDED — new in SING9",
      "Story surface alignment ADDED — new in SING9",
      "Carbon pawn promotion as Sword from the Stone ADDED — story integration",
      "Tier board mapping ADDED — cosmological stack mapped to chess board zones",
      "Production house details fully integrated from HERO_JO_GOLDEN_BACKDOOR_STUDIOS_SNAP.md"
    ]
  }
}
